Revit 2027 API
MemberForcesServiceData Methods
The MemberForcesServiceData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurrentElements |  Returns the list of Ids of the current elements.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
MemberForcesServiceData Class
Autodesk.Revit.DB.Structure Namespace